NOxFoam/example/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.2";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
5835
(
(59.866889 -0.078766323 2.2440206e-08)
(58.54597 -0.28109732 3.9471169e-08)
(54.13577 -0.34379152 2.6518864e-08)
(45.126231 -0.39942797 2.0864187e-08)
(59.2128 -0.0314945 1.9904776e-08)
(58.017946 -0.044146949 3.1586336e-08)
(53.765515 -0.056672739 2.2793067e-08)
(44.787283 0.023411066 1.3786358e-08)
...
)
;

boundaryField
{
    inletCH4
    {
        type            fixedValue;
        value           uniform (49.6 0 0);
    }
    wallOutside
    {
        type            fixedValue;
        value           uniform (0.9 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
51
(
(8.5491587 0.017593667 -6.4035264e-08)
(8.5827439 0.014235441 -5.5994721e-08)
(8.3755053 0.028994561 -8.6793667e-08)
(8.640239 0.0024003077 -1.3178011e-08)
(8.6360406 0.0046221736 -2.6505867e-08)
(8.6267365 0.007419422 -3.6523806e-08)
(8.6127666 0.010373639 -4.5394734e-08)
(8.6000016 0.01212416 -5.0274464e-08)
...
)
;
    }
    inletPilot
    {
        type            fixedValue;
        value           uniform (11.4 0 0);
    }
    wallTube
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inletAir
    {
        type            fixedValue;
        value           uniform (0.9 0 0);
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
