NOxFoam/example/0/CH4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.2";
    object      CH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
5835
(
0.15609999
0.15609986
0.15609841
0.15608765
0.1561
0.1561
0.15609999
0.15609997
...
)
;

boundaryField
{
    inletCH4
    {
        type            fixedValue;
        value           uniform 0.1561;
    }
    wallOutside
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    inletPilot
    {
        type            fixedValue;
        value           uniform 0;
    }
    wallTube
    {
        type            zeroGradient;
    }
    inletAir
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
