NOxFoam/example/0/CO2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.2";
    object      CO2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
5835
(
1.0127535e-08
1.028882e-07
1.2114604e-06
9.4008575e-06
4.4056502e-11
3.6449542e-10
3.8368243e-09
2.3825106e-08
...
)
;

boundaryField
{
    inletCH4
    {
        type            fixedValue;
        value           uniform 0;
    }
    wallOutside
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    inletPilot
    {
        type            fixedValue;
        value           uniform 0.1098;
    }
    wallTube
    {
        type            zeroGradient;
    }
    inletAir
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
