NOxFoam/example/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.2";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
5835
(
300
300
300
300
300
300
300
300
...
)
;

boundaryField
{
    inletCH4
    {
        type            fixedValue;
        value           uniform 294;
    }
    wallOutside
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    inletPilot
    {
        type            fixedValue;
        value           uniform 1880;
    }
    wallTube
    {
        type            zeroGradient;
    }
    inletAir
    {
        type            fixedValue;
        value           uniform 291;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
