NOxFoam/example/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.2";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
5835
(
2661.3394
7556.7742
32330.703
113675.54
2490.0927
6607.8945
29004.102
119009.16
...
)
;

boundaryField
{
    inletCH4
    {
        type            compressible::turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.000504;
        phi             phi;
        k               k;
        value           uniform 7021.4967;
    }
    wallOutside
    {
        type            compressible::epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
110
(
0.009046793
0.0089034969
0.0087587535
0.0086140081
0.0084718519
0.0083325404
0.0081955902
0.0080608734
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    inletPilot
    {
        type            compressible::turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.000735;
        phi             phi;
        k               k;
        value           uniform 150.70405;
    }
    wallTube
    {
        type            compressible::epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
77
(
782.58152
57533.002
45613.181
57016.718
44853.448
59934.435
42007.869
47513.745
...
)
;
    }
    inletAir
    {
        type            compressible::turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.019677;
        phi             phi;
        k               k;
        value           uniform 0.0011685576;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
