NOxFoam/example/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.2";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
5835
(
3.3825033
5.6222297
13.292421
24.53913
3.3055132
5.2375968
12.540742
25.300837
...
)
;

boundaryField
{
    inletCH4
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.0458;
        value           uniform 7.740795;
    }
    wallOutside
    {
        type            compressible::kqRWallFunction;
        value           nonuniform List<scalar> 
110
(
0.0026148817
0.0025871942
0.002559078
0.0025308067
0.0025028863
0.0024753727
0.0024481755
0.0024212736
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    inletPilot
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.0628;
        value           uniform 0.76881217;
    }
    wallTube
    {
        type            compressible::kqRWallFunction;
        value           nonuniform List<scalar> 
77
(
2.2282236
18.314609
15.074735
18.204856
14.906842
18.820734
14.269425
16.121166
...
)
;
    }
    inletAir
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.0471;
        value           uniform 0.0026953681;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
