NOxFoam/example/0/mut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.2";
    object      mut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
5835
(
0.00039804688
0.00038738773
0.00050616401
0.00049068203
0.00040644758
0.00038461648
0.00050239032
0.00049838434
...
)
;

boundaryField
{
    inletCH4
    {
        type            zeroGradient;
    }
    wallOutside
    {
        type            zeroGradient;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    inletPilot
    {
        type            zeroGradient;
    }
    wallTube
    {
        type            zeroGradient;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
77
(
0
0
0
0
0
0
0
0
...
)
;
    }
    inletAir
    {
        type            zeroGradient;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
