NOxFoam/example/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat raw;

interpolationScheme cell;

sets
(   
    axial
    {
        type        midPointAndFace; //uniform
        axis        x;
        start   ( 0 0.000001 0 );
        end     ( 1 0.000001 0 );
        //nPoints 1000;
    }
    radial
    {
        type        midPointAndFace; //uniform
        axis        y;
        start   ( 0.429 0 0 );
        end     ( 0.429 1 0 );
        //nPoints 1000;
    }
);

fields (NO);


// *********************************************************************** //
